{"data":{"markdownRemark":{"html":"<h2>4.5.6.2 Analogue and Digital</h2>\n<p>Analog has a continuous range of values, whereas digital has only two states.\nOn or off, one or zero</p>\n<pre><code>|\n|               ###\n|             ##   ##\n|            #       #\n|-#---------#---------#---------#--> Time\n|  #       #           #       #\n|   ##   ##             ##   ##\n|     ###                 ###\n|\n</code></pre>\n<p><em>An example analog wave</em></p>\n<pre><code>|\n|    ########      ########\n|    #      #      #      #\n|    #      #      #      #\n|#####------########------########-> Time\n|\n|\n|\n|\n</code></pre>\n<p><em>An example digital wave</em></p>\n<h2>4.5.6.4 Bitmapped Graphics</h2>\n<p>Bitmaps rely on a series of square blocks called pixels.\nEach pixel is a square, and each pixel is defined with it's own colour.</p>\n<p>PPI defines the density of the image, pixels by inch.</p>\n<p>Bitmap graphics are usually photographs.\nThey can be scanned or photographged with a digital camera.\nYou can create/draw images with appropriate hardware and bitmap graphic software, e.g. Adobe Photohop or the GNU Image Manipulation Program</p>\n<p>Bitmap graphics are made up of thousands of individual dots called pixels.\nResolution is determined by how many pixels are are per square inch.\nPixels are placed side-by-side to create a continuous image.</p>\n<p>Lossy image formats include:</p>\n<ul>\n<li>.jpeg</li>\n<li>.jpg</li>\n</ul>\n<p>Lossless image formats include:</p>\n<ul>\n<li>.gif</li>\n<li>.png (image/png)</li>\n<li>.xcf</li>\n<li>.tiff</li>\n</ul>\n<p>Note that information is lost whenever the image is enlarged.</p>\n<h3>Colours</h3>\n<h4>RGB</h4>\n<p>The RGB colour model is an additive colour model in which red, green and blue are added together to create colours.</p>\n<h4>CYMK</h4>\n<p>The CYMK colour model is a subtractive colour model in which cyan, magenta, yellow and a key.</p>\n<h3>Bit Depth</h3>\n<p>The bit depth defines the number of colours the image has. The chosen file depth determines the file depth.</p>\n<p>The more bits per pixel, the greater the colour depth.\nDecreasing the bits per pixel makes the image look posterised.</p>\n<h3>Resolution</h3>\n<p>The resolution is the number of pixels that an image has.\nA higher resolution image can store more image detail.</p>\n<h3>Alpha</h3>\n<p>As well as RGB, a fourth channel \"Alpha\" may be included for transparency.</p>\n<h3>Metadata</h3>\n<p>Metadata is information stored in the file about the data itself.\nThis data describes the format of the file, the resolution, the colour depth, etc.\nThis is usually encoded in the file using the Exif metadata standard.</p>\n<p>Information that can be encoded includes:</p>\n<ul>\n<li>Aperture</li>\n<li>GPS</li>\n<li>Make and model of camera</li>\n<li>Height</li>\n<li>Width</li>\n</ul>\n<h3>File Size</h3>\n<p>\\({Width \\times Height \\times Bit Depth \\over 8} + Metadata = Size\\) (In Bytes)</p>\n<p>Max non-compressed crap storage format</p>\n<h2>4.5.6.5 Vector Graphics</h2>\n<p>A vector graphic is made of mathematic instructions.</p>\n<p>Geometrical primitives include:</p>\n<ul>\n<li>points</li>\n<li>lines</li>\n<li>curves</li>\n<li>shapes</li>\n<li>polygons</li>\n</ul>\n<p>Bézier curves allow magical curves to appear.</p>\n<p><img src=\"/assets/img/circletine.svg\" alt=\"Circletine\"></p>\n<h2>4.5.6.6 Vector Graphics vs Bitmapped Graphics</h2>\n<p>Vector graphics are significantly smaller in size, but are primitive.\nBecause vector graphics are calculated, scaling is possible at any size. Bitmapped images do not scale well</p>\n<h3>Vector</h3>\n<div class=\"to-vscode\">\n+ Low file size\n+ Quality Maintained\n- Only colour of whole lines or shapes chan be changed\n- Complex images are hard to reproduce\n- Thin lines may disappear if shrank to small\n- Small errors can be magnified when scaled\n</div>\n<h3>Bitmap</h3>\n<div class=\"to-vscode\">\n+ Easy to work with\n+ Colour of each dot can be changed\n+ Common and widely used\n- Lossy when resolution increased\n- Takes up a lot of computer backing storage\n</div>\n<h2>4.5.6.7 Digital representation of sound</h2>\n<p>Keywords include:</p>\n<p>A sound wave is a change in air pressure, which ears interpret as sound. A microphone records an analog signal, and a DAC converts it into a digital signal.</p>\n<p>Advantages of a digital signal</p>\n<div class=\"to-vscode\">\n+ Can copy without loss of data\n- Not exactly the original sound\n</div>\n<h3>Frequency</h3>\n<p>CDs use 44.1 kHz as this is two times 20kHz, the maximum frequency that the human ear can hear. This is to record both the peak and trouch of the wave, so give a close representation of the true sound.</p>\n<h3>Bit Depth</h3>\n<p>The bit depth determines the range of volumes storable for each sample. If you have a low sampling resolution (bit depth) then the rangew of volumes will be very limited, if you have a high sampling resolution (bit depth) then the file size may become unfeasible. The sampling resolution (bit depth) for a CD is 16 bits per sample.</p>\n<table>\n<thead>\n<tr>\n<th>Bit Depth</th>\n<th>Usually...</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>16</td>\n<td>CD</td>\n</tr>\n<tr>\n<td>24</td>\n<td>DVD</td>\n</tr>\n</tbody>\n</table>\n<h3>Bit Rate</h3>\n<p>The bit rate of a file tells us how many bits of data are processed every second. Bit rates are usually measured in kilobits per second (kbps).</p>\n<h4>Calculating bit rate</h4>\n<p>The bit rate is calculated using the formula:</p>\n<p>\\(frequency * bit depth * channels = bit rate\\)</p>\n<p>For example, the file size of an audio file that:</p>\n<ul>\n<li>Lasts for 5 minutes</li>\n<li>Has a sample rate of 411000 samples per second</li>\n<li>Has a bit depth of 24 bits</li>\n<li>Is stereo</li>\n</ul>\n<div class=\"to-vscode\">\n591840000 ........ Bits\n 73980000 ........ Bytes\n       73.98 ..... Megabytes\n       70.55282593 Mibibytes\n</div>\n<h2>4.5.6.9 Compression</h2>\n<ul>\n<li>Know why images and sound files are often compressed</li>\n<li>Understand the difference between lossless and lossy compression and explain the advantages and disadvantages</li>\n</ul>\n<p>Compression is a useful tool for reducing file sizes.\nWhen images, sound or videos are compressed, data is compressed to reduce the file size.\nThis is very helpful when <strong>streaming</strong> and <strong>downloading</strong> files.</p>\n<p>Streamed music and downloadable files, such as <strong>mp3s</strong> are usually between 128kbps and 320kbps, much lower than 1.4 mbps of an uncompressed file.</p>\n<p>Videos are also compressed when they are streamed over a network.\nStreaming HD video requires a high-speed internet connection.\nWithout it, the user would experience buffering and regular drops in quality.\nHD video is around 3 Mbps, while SD is 1.5 Mbps</p>\n<div class=\"to-vscode\">\n+ Uses less internet bandwidth when they are downloaded so transfer speed is quicker\n+ Takes up less storage space on the servers of storage providers or on devices\n+ Smaller files reduces congestion on the internet, which is good for everyone\n+ It makes audio and video files suitable for streaming\n+ Email services usually normally have restrictions on the size of the attachment you can send\n</div>\n<iframe class=\"youtube\" src=\"https://www.youtube.com/embed/guo8if4Yxhw\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe>\n_Video is copyright LinusMediaGroup_\n<h4>Lossless compression</h4>\n<p>Lossless compression means that as the file size is compressed, the image or audio quality remains the same\nIt does not get worse.\nAlso, the file can be restored to it's original state.\nFLAC and ALAC are open source lossless compression formats.</p>\n<h4>Lossy compression</h4>\n<p>Lossy compression permanently removes data.\nFor example, a WAV file compressed to an MP3 would be lossy compression.\nThe bit rate could be set at 64kbps, which would reduce the size and the quality of the file.\nHowever, it would not be possible to recreate a 1411kbps quality file from a 64kbps MP3.</p>\n<p>With lossy compression, the original bit depth is reduced to remove data and reduce the file size.\nThe bit depth becomes variable.</p>\n<p>MP3 and AAC are lossy compressed audio file formats widely supported on different platforms.\nMP3 and AAC are both patented codecs.</p>\n<h4>Audio compression</h4>\n<p>Audio files can be compressed in a similar way to image files.\nDigital audio files that contain all of the sound data are saved in a Waveform Audio (WAV) format.\nTypically a 3 minute recording will have a file size of 30MB.\nThere are frequencies and tones we cannot hear and slight differences in volume and frequency we cannot distinguish.\nThese are removed to reduce the size and an MP3 file is usually a tenth of the size of a wav file.</p>\n<h4>Digital Video Compression</h4>\n<p>A digital film is created from a series of static images played at high speed.\nFilms have a frame rate.</p>\n<table>\n<thead>\n<tr>\n<th>Media</th>\n<th>Rate</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Console Peasants</td>\n<td>30fps</td>\n</tr>\n<tr>\n<td>Film</td>\n<td>24fps</td>\n</tr>\n<tr>\n<td>TV (PAL)</td>\n<td>25fps</td>\n</tr>\n<tr>\n<td>TV (NTSC)</td>\n<td>30fps</td>\n</tr>\n<tr>\n<td>Computers</td>\n<td>60fps (usually, 120, 144, 240+ are available)</td>\n</tr>\n</tbody>\n</table>\n<p>Videos are compressed to:</p>\n<ul>\n<li>Reduce the resolution</li>\n<li>Reduce the dimensions</li>\n<li>Reduce the bit rate</li>\n</ul>\n<p>Delta encoding is used to reduce the file size of a film by storing pixels that do not change between each frames instead of replicating them for each frame.</p>\n<iframe class=\"youtube\" src=\"https://www.youtube.com/embed/qbGQBT2Vwvc\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe>\n_Video is copyright LinusMediaGroup_\n<h4>Codecs</h4>\n<p>Codecs are programs that encode data as usable files, whether images, audio or video.</p>\n<iframe class=\"youtube\" src=\"https://www.youtube.com/embed/GhWki9a7s18\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe>\n_Video is copyright LinusMediaGroup_\n<h4>Run Length Encoding (RLE)</h4>\n<p>One of the simplest examples of compression is RLE.\nRLE is a basic form of data compression that converts consecutive identical values into a code sonsisting of the character and the number marking the length of the run.\nThe more similar values there are, the more values can be compressed.\nThe sequence of data is stored as a single value and count.</p>\n<table>\n<thead>\n<tr>\n<th>Encoding</th>\n<th>Size</th>\n<th>Text</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>None</td>\n<td>71B</td>\n<td>BASIC AND STUPID, THE RLE IS CRAP COMPARED TO OTHER SIZE SAVING METHODS</td>\n</tr>\n<tr>\n<td>RLE</td>\n<td>71B</td>\n<td>BASIC AND STUPID, THE RLE IS CRAP COMPARED TO OTHER SIZE SAVING METHODS</td>\n</tr>\n<tr>\n<td>None</td>\n<td>52B</td>\n<td>AAAAAABBCCCCCCCDDDDDEEEEEEEE XXXXXXDDDDDDDD TWAISUUU</td>\n</tr>\n<tr>\n<td>RLE</td>\n<td>23B</td>\n<td>6A2B7C5D8E 6X8D TWAIS3U</td>\n</tr>\n</tbody>\n</table>\n<p>The RLE is not the best compression method available.</p>\n<h1>Questions</h1>\n<p><a href=\"answers#456-representing-images-sound-and-other-data\">Answer</a></p>\n<p><a href=\"/assets/documents/soundgraph.ods\"><img src=\"/assets/img/soundgraph.png\" alt=\"A line graph\"></a></p>\n<ol>\n<li>Convert this analogue signal to an 3 bit depth digital representation</li>\n</ol>\n<pre><code>hhhhhheeeeeeeeemmmmmttttttttttiihhhhha\n</code></pre>\n<ol>\n<li>How many bytes are used for the above string?</li>\n<li>What is the RLE encoded string for this string?</li>\n<li>How many bytes are used after encoding?</li>\n<li>How many bytes have been saved?</li>\n</ol>","frontmatter":{"pagename":"4.5.6 Representing images, sound and other data"},"fields":{"filename":"4-5-6"}}},"pageContext":{"permalink":"/7517/4-5-6"}}