{"data":{"markdownRemark":{"html":"<h2>4.5.6 Representing images, sound and other data</h2>\n<p><a href=\"/assets/documents/soundgraph.ods\"><img src=\"/assets/img/soundgraph.png\" alt=\"A line graph\"></a></p>\n<ol>\n<li>Convert this analogue signal to an 3 bit depth digital representation</li>\n<li>000 010 100 111 110 011 010 001</li>\n</ol>\n<pre><code>hhhhhheeeeeeeeemmmmmttttttttttiihhhhha\n</code></pre>\n<ol>\n<li>How many bytes are used for the above string?</li>\n<li>38 bytes</li>\n<li>What is the RLE encoded string for this string?</li>\n<li>\n<p><code>6h9e5m10t2i5h1a</code></p>\n<ul>\n<li>If there must always be a number</li>\n</ul>\n</li>\n<li>\n<p><code>6h9e5m10t2i5ha</code></p>\n<ul>\n<li>If the 5 in 5h does not apply to the a</li>\n<li><code>5(h) + a</code>, not <code>5(ha)</code></li>\n</ul>\n</li>\n<li>How many bytes are used after encoding?</li>\n<li>15 bytes</li>\n<li>How many bytes have been saved?</li>\n<li>23 bytes</li>\n</ol>\n<h2>4.6.1.2 Classification of software</h2>\n<ol>\n<li>Explain what is meant by system software</li>\n<li>System software is software that runs the operating system, utilities for the system and drivers which runs the computer.</li>\n<li>Explain what is meant by application software</li>\n<li>Application software is \"every day\" software that is not part of system software, such as word processing software, image manipulation software and web browsers.</li>\n<li>What is general purpose software and discuss the pros and cons associated to it</li>\n<li>General purpose application software is software that is designed to perform multiple \"general\" tasks around a \"general\" category, such as a word processing software being able to make emails, letters, mail merge and more.</li>\n<li>\n<p>Advantages</p>\n<ul>\n<li>It is relatively cheap</li>\n<li>Readily available</li>\n<li>Great support</li>\n<li>Less bugs as more people have tested the software</li>\n</ul>\n</li>\n<li>\n<p>Disadvantages</p>\n<ul>\n<li>May not be specific enough</li>\n<li>May be more expensive in the long term, if subscription based</li>\n<li>Can't fix yourself</li>\n</ul>\n</li>\n<li>What is special purpose application software and discuss the pros and cons associated to it</li>\n<li>Special purpose application software is software that is designed to perform a range of tasks in a single category, such as student register programs.</li>\n<li>\n<p>Advantages</p>\n<ul>\n<li>Built for purpose</li>\n<li>Has less unnecessary bulk that is not required for the task</li>\n</ul>\n</li>\n<li>\n<p>Disadvantages</p>\n<ul>\n<li>More expensive</li>\n<li>May need training, as the software is uncommon</li>\n<li>More bugs as less people have tested the software</li>\n</ul>\n</li>\n<li>What is bespoke application software and discuss the pros and cons associated to it</li>\n<li>Bespoke application software is software built for a specific person and/or business for only the required task, such as a <a href=\"https://ls.terminal.ink/\" target=\"_blank\" rel=\"noopener noreferrer\">Discord Bot List</a> (<em>cross promo</em>)</li>\n<li>\n<p>Advantages</p>\n<ul>\n<li>Built for purpose</li>\n<li>\n<p>Can be designed the way the person and/or business likes it to</p>\n<ul>\n<li>Can include \"House Style\" colours and/or design</li>\n</ul>\n</li>\n<li>Can quickly remove bugs that may be included, as the time taken to contact developers is decreased</li>\n</ul>\n</li>\n<li>\n<p>Disadvantages</p>\n<ul>\n<li>Most expensive to develop and deploy</li>\n<li>Will need training, as new employees will have never seen the software before</li>\n</ul>\n</li>\n<li>Complete the attributes column of the table below</li>\n</ol>\n<table>\n<thead>\n<tr>\n<th>Type</th>\n<th>Use</th>\n<th>Attributes</th>\n<th>Why this type of software is more appropriate for use specified compared to the alternatives</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Word processing application</td>\n<td>Writing reports, memos, letters to customers</td>\n<td>A rich text editor with support for typesetting text with images, columns, fonts, etc. on a variety of formats, such as varying paper sizes, websites or emails</td>\n<td>Allows for the creation of text based documents which can automatically resize to fit page sizes and changes within the document.</td>\n</tr>\n<tr>\n<td>Spreadsheet application</td>\n<td>Keeping simple company accounts, calculating employee commission payments, simple stock control system, modelling</td>\n<td>A table with co-ordinates referring to cells, usually via a letter and a number combination which can be used to display numbers and perform automatic calculations in a table. Some may include the capability to create graphs and perform advanced calculations</td>\n<td>Can allow quick \"number crunching\" to be performed on smaller data sets with less complex commands.</td>\n</tr>\n<tr>\n<td>Database application</td>\n<td>Keeping customer records, sales records, appointments system</td>\n<td>A program that can store data in the form of records, which can programatically be accessed by a server or client via SQL commands, or no-SQL commands, and with the ability to filter. Records each need an individual unique key, called the primary key</td>\n<td>Is faster to retrieve data compared to a spreadsheet, and can be accessed via multiple different servers.</td>\n</tr>\n<tr>\n<td>Desktop publishing application</td>\n<td>Creating leaflets, posters, business cards</td>\n<td>A program allowing the creation of documents with control on the location of elements on the page</td>\n<td>Allows the creation of documents with typesetting and design considerations.</td>\n</tr>\n<tr>\n<td>Presentation software</td>\n<td>Creating presentations to show to customers or staff</td>\n<td>A slide editor and viewer which can create and present slides, with free control on the location of elements, and may also include transitions, animations, hyperlinks and other embeds to enhance the presentation</td>\n<td>Has a presentation mode to look more professional. Each slide is it's own page, so content does not overflow.</td>\n</tr>\n<tr>\n<td>Graphics application</td>\n<td>Manipulating images that can be used at home, school or a business</td>\n<td>An editor which allows the editing of image files</td>\n<td>Can edit images.</td>\n</tr>\n<tr>\n<td>Web design application</td>\n<td>Creating personal or business websites</td>\n<td>A WYSIWYG editor which allows the editing of a webpage as it appears on the screen, as well as editing the HTML and CSS. May come with templates and helpers to allow quick and fast prototyping of a website.</td>\n<td>Includes a WYSIWYG preview window, which allows the user to visualise the output before saving and opening it in a browser. May include HTML, CSS and JS specific helpers designed to automatically include/help the user to add new elements to the page.</td>\n</tr>\n</tbody>\n</table>\n<h2>4.6.3.1 Types of program translator</h2>\n<ol>\n<li>Do interpreters produce a binary?</li>\n<li>False. They run the code line by line, statement by statement.</li>\n<li>Which method is faster to run code and why?</li>\n<li>Compiled code is faster compared to interpreted code at the \"running\" stage, as the program is converted to a binary which a computer understands.</li>\n<li><strong>Do not accept:</strong> Interpreted as you need to wait for the compiler to compile a binary.</li>\n</ol>\n<h2>4.6.5 Boolean Algebra</h2>\n<ol>\n<li>Simplify \\(\\overline{(\\overline A+B)}+\\overline{(\\overline A+C)}\\)</li>\n<li>Use De Morgan's Law: \\((\\overline{\\overline A}.\\overline B)+(\\overline{\\overline A}.\\overline C)\\)</li>\n<li>Use Double Complement Law: \\((A.\\overline B)+(A.\\overline C)\\)</li>\n<li>Use the Distributive Law: \\(A.(\\overline B+\\overline C)\\)</li>\n</ol>","frontmatter":{"pagename":"Answers"},"fields":{"filename":"answers"}}},"pageContext":{"permalink":"/7517/answers"}}