{"data":{"markdownRemark":{"html":"<h2>4.6.3.1 Types of program translator</h2>\n<p>Most programming languages can be edited wthin a text editor and/or a dedicated IDE.\nHowever, the text alone is not good enough to be ran.\nComputer programs must be processed either by a <strong>compiler</strong> or an <strong>interpreter</strong> in order to execute the code.</p>\n<h3>Compiler</h3>\n<p>A compiler is a computer program which converts code into a binary.\nThis binary can be ran multiple times, without recalling the compiler.\nThe resultant file from the compiler can only run on the same computer architecture that it was compiled for, and may be incompatible due to architecture, operating system incompatibilities, etc.\nBecause a binary is generated, it may take time for the computer program to compile.\nAfter compilation, running the program will take less time.</p>\n<p>The programmer's code sometimes requires extra libraries and object code.\nWhen this is required, a linker includes these libraries (like ::std) and combines them into the final binary by a <strong>linker</strong>.</p>\n<p>Examples of compiled languages include:</p>\n<ul>\n<li>Go</li>\n<li>C</li>\n<li>C++</li>\n</ul>\n<h4>Advantages</h4>\n<ul>\n<li>Binaries are faster compared to interpreted code</li>\n</ul>\n<h4>Disadvantages</h4>\n<ul>\n<li>Entire code has to be written before it can be tested</li>\n<li>Errors require recompilation of the binary</li>\n<li>Binary only runs on that architecture and that operating system</li>\n</ul>\n<h3>Interpreter</h3>\n<p>An interpreter is an intermediate program which reads code line by line, statement by statement and runs the code in real time.\nThis allows programmers to edit the code in real time without waiting for recompliation.\nHowever, interpreted languages have to have the code distributed with the interpreter.\nThis may mean the source code could be leaked and stolen by others.\nAn interpreter can run code on all compatible clients.</p>\n<p>Examples of interpreted languages include:</p>\n<ul>\n<li>Python</li>\n<li>JavaScript (Node.js)</li>\n</ul>\n<h4>Advantages</h4>\n<ul>\n<li>Faster to test</li>\n<li>Can immediately fix errors (as interpreter runs up to the error)</li>\n<li>Can run on multiple systems (with the interpreter installed on multiple systems)</li>\n</ul>\n<h4>Disadvantages</h4>\n<ul>\n<li>Translation takes longer to do</li>\n<li>Uses more RAM</li>\n<li>Must be interpreted each time the program is ran</li>\n</ul>\n<h3>Java?</h3>\n<p>Java uses a combination of both to merge some of the benefits of each. (While also combining the negatives)</p>\n<p>Java uses a compiler to compile java code into java bytecode.\nThis bytecode is read by the JVM (The Java Virtual Machine) which processes the bytecode.</p>\n<p>Some implementations of the JVM uses <strong>just-in-time</strong> compilation, where the bytecode is converted into instructions the host computer can understand.\nOther implementations may instead use an interpreter to run the code.</p>\n<p>Because of the complexity of how Java is processed and executed, there is <a href=\"https://stackoverflow.com/questions/1326071/is-java-a-compiled-or-an-interpreted-programming-language\" target=\"_blank\" rel=\"noopener noreferrer\">argument</a>{: .ext} about whether or not it uses one, both, none and/or parts of compilation and intepreting.</p>\n<p><img src=\"/assets/img/jvm.png\" alt=\"&#x22;no u&#x22;\"></p>\n<h1>Questions</h1>\n<p><a href=\"answers#463\">Answer</a></p>\n<ol>\n<li>Do interpreters produce a binary?</li>\n<li>Which method is faster to run code and why?</li>\n</ol>","frontmatter":{"pagename":"4.6.3 Types of program translator"},"fields":{"filename":"4-6-3"}}},"pageContext":{"permalink":"/7517/4-6-3"}}