{"data":{"markdownRemark":{"html":"<h2>4.7.1.1 Internal hardware components of a computer</h2>\n<p>A computer is made up of many individual components.</p>\n<p>Some components include:</p>\n<ul>\n<li>Processor</li>\n<li>Main Memory</li>\n<li>Address Bus</li>\n<li>Data Bus</li>\n<li>Control Bus</li>\n<li>I/O Controllers</li>\n</ul>\n<h3>Processor (CPU)</h3>\n<p>The processor is a component within a computer which performs all of the computation and calculation.\nIt can be thought of the \"processing\" part of a brain.</p>\n<h3>Main Memory (RAM)</h3>\n<p>The main memory in a computer stores data temporarily for use by the processor.</p>\n<h3>Address Bus</h3>\n<p>This \"bus\" is a set of wires which identifies the address that is being targeted by the CPU.</p>\n<h3>Data Bus</h3>\n<p>This bus sends and returns data to and from all the components which may require data.</p>\n<h3>Control Bus</h3>\n<p>A set of wires which determines the state which the main memory acts as, such as read or write.</p>\n<h3>I/O Controllers</h3>\n<p>A component which interacts with other parts of the system.</p>\n<iframe class=\"youtube\" src=\"https://www.youtube.com/embed/cNN_tTXABUA\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe>\n_Video Copyright **In One Lesson**_\n<h3>Von Neumann Architecture</h3>\n<p>The Von Neumann Architecture is an architecture of computing where both data used for programs, and the programs themselves are stored within the same main memory.</p>\n<p>Advantages include:</p>\n<ul>\n<li>Easier to handle</li>\n</ul>\n<p>Disadvantages include:</p>\n<ul>\n<li>CPU has to wait for instructions to arrive, then data</li>\n<li>Data can be accidentally interpreted as a program</li>\n</ul>\n<p>It can be represented in a \"Three box model\". The diagram represents the data bus in which all three components, the CPU, Main Memory and I/O all communicate on.</p>\n<p><img src=\"/assets/img/3boxmodel.png\" alt=\"Three box? More like 3 box and 4 arrows\"></p>\n<p>The Vonn Neumann architecture is the architecture most alike our computers today.</p>\n<h3>Harvard Architecture</h3>\n<p>The Harvard Architecture has separate memory stores and busses for data and programs.</p>\n<p>Advantages include:</p>\n<ul>\n<li>CPU can simultaneously fetch instructions and programs</li>\n</ul>\n<p>Disadvantages include:</p>\n<ul>\n<li>Hard to program for</li>\n<li>More space is required, as there are two busses and stores</li>\n</ul>\n<p><img src=\"/assets/img/harvard.png\"></p>\n<h3>Types of CPU</h3>\n<p>There are two types of CPU - CISC, or <code>Complex Instruction set Computing</code>, and RISC, or <code>Reduced Instruction set Computing</code>.\nMain differences include:</p>\n<ul>\n<li>\n<p>Number of instructions</p>\n<ul>\n<li>RISC has less instructions than CISC. CISC CPUs have more \"complicated\" instructions, so can achieve some tasks using less operations.</li>\n<li>CISC CPUs will need to combine multiple instructions to perform the same task.</li>\n</ul>\n</li>\n<li>\n<p>Size</p>\n<ul>\n<li>As CISC CPUs have more instructions, more silicon is required to support this.</li>\n</ul>\n</li>\n<li>\n<p>Clock Speed</p>\n<ul>\n<li>RISC CPUs commonly run with a lower clock speed compared to CISC CPUs</li>\n</ul>\n</li>\n<li>\n<p>Energy Consumption</p>\n<ul>\n<li>CISC CPUs consume more energy compared to RISC CPUs.</li>\n</ul>\n</li>\n</ul>","frontmatter":{"pagename":"4.7.1 Internal hardware components of a computer"},"fields":{"filename":"section-4.7.1"}}},"pageContext":{"permalink":"/7517/section-4.7.1"}}